xtee55/mediator-common-test/src/main/resources/v5xroad-test.request

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ZSI="http://www.zolera.com/schemas/ZSI/" 
  xmlns:foobar="http://example.com/xsd/foobar.xsd" 
  xmlns:xtpais="http://x-tee.riik.ee/xsd/xtee.xsd" 
  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" >
<SOAP-ENV:Header>
<xtpais:asutus foobar="http://example.com/xsd/foobar.xsd" xtpais="http://x-tee.riik.ee/xsd/xtee.xsd" xsi:type="xsd:string">toll.0123456789</xtpais:asutus>
<xtpais:andmekogu foobar="http://example.com/xsd/foobar.xsd" xtpais="http://x-tee.riik.ee/xsd/xtee.xsd" xsi:type="xsd:string">andmekogu64</xtpais:andmekogu>
<xtpais:isikukood foobar="http://example.com/xsd/foobar.xsd" xtpais="http://x-tee.riik.ee/xsd/xtee.xsd" xsi:type="xsd:string">27001010001</xtpais:isikukood>
<xtpais:id foobar="http://example.com/xsd/foobar.xsd" xtpais="http://x-tee.riik.ee/xsd/xtee.xsd" xsi:type="xsd:string">testquery4</xtpais:id>
<xtpais:nimi foobar="http://example.com/xsd/foobar.xsd" xtpais="http://x-tee.riik.ee/xsd/xtee.xsd" xsi:type="xsd:string">andmekogu64.testQuery.v1</xtpais:nimi>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<foobar:testQuery>
<keha>
<esimene_liidetav xsi:type="xsd:integer">23</esimene_liidetav>
<keha xsi:nil="1"/>
<teine_liidetav xsi:type="xsd:integer">89</teine_liidetav>
<mingi_muu_parameeter id="b7d6fbf0" xsi:type="xsd:string">Valge viinaga on hea</mingi_muu_parameeter>
<aeg xsi:type="xsd:dateTime">1960-05-18T14:51:56Z</aeg>
<files id="b7967d8c" SOAP-ENC:arrayType="String[]">
</files>
<attach_requests id="b795746c" SOAP-ENC:arrayType="String[]">
</attach_requests>
</keha>
</foobar:testQuery>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
